morfredus/ESP32-Diagnostic/src/main.cpp
/*
 * ESP32 Diagnostic Suite v3.9.0-dev
 * Compatible: ESP32 class targets with >=4MB Flash & >=8MB PSRAM (ESP32 / ESP32-S3)
 * Optimized for ESP32 Arduino Core 3.3.3 / PlatformIO
 * Tested board: ESP32-S3 DevKitC-1 N16R8 with PSRAM OPI (Core 3.3.3)
 * Author: morfredus
 * v3.8.01-dev - Modern responsive UI with sticky header
 * v3.8.03-dev - Complete UI redesign with shadow effects and compact header
 * v3.8.04-dev - Compact header, chip type inline, language buttons repositioned
 * v3.8.05-dev - Unified font sizes across header elements to match UI
 * v3.8.06-dev - Premium color palette with enhanced shadow system
 * v3.8.08-dev - Fixed PlatformIO compilation errors (LEDC API, MDNS)
 * v3.8.09-dev - Attempted MbedTLS CMAC fixes (linking issues persist)
 * v3.9.0-dev - Code maintenance: fixed runtimeBLE bug, cleaned comments and dead code
 */

#include <WiFi.h>
#include <WiFiMulti.h>
#include <WebServer.h>

#if defined(ARDUINO_ARCH_ESP32)
  #include <freertos/FreeRTOS.h>
  #include <freertos/task.h>
  #if defined(__has_include)
    #if __has_include(<ESPmDNS.h>)
      #include <ESPmDNS.h>
      #define DIAGNOSTIC_HAS_MDNS 1
      #define DIAGNOSTIC_USES_ESPMDNS 1
    #elif __has_include(<mdns.h>)
      #include <mdns.h>
      #define DIAGNOSTIC_HAS_MDNS 1
      #define DIAGNOSTIC_USES_IDF_MDNS 1
    #else
      #define DIAGNOSTIC_HAS_MDNS 0
    #endif
  #else
    #include <ESPmDNS.h>
    #define DIAGNOSTIC_HAS_MDNS 1
    #define DIAGNOSTIC_USES_ESPMDNS 1
  #endif
#else
  #define DIAGNOSTIC_HAS_MDNS 0
#endif

#if !defined(DIAGNOSTIC_HAS_MDNS)
  #define DIAGNOSTIC_HAS_MDNS 0
#endif

#if DIAGNOSTIC_HAS_MDNS && defined(DIAGNOSTIC_USES_ESPMDNS)
  #if defined(NO_GLOBAL_MDNS) || defined(NO_GLOBAL_INSTANCES)
    static MDNSResponder diagnosticMDNSResponder;
    #define DIAGNOSTIC_MDNS_SERVER diagnosticMDNSResponder
  #else
    #define DIAGNOSTIC_MDNS_SERVER MDNS
  #endif
#endif
#include <esp_chip_info.h>
#include <esp_err.h>
#include <esp_mac.h>
#include <esp_flash.h>
#include <esp_heap_caps.h>
#include <esp_partition.h>
#include <esp_wifi.h>
#include <esp_task_wdt.h>
#if defined(__has_include)
  #if __has_include(<sdkconfig.h>)
    #include <sdkconfig.h>
    #define DIAGNOSTIC_HAS_SDKCONFIG 1
  #endif
  #if __has_include(<esp_netif.h>)
    #include <esp_netif.h>
    #define DIAGNOSTIC_HAS_ESP_NETIF 1
  #endif
  #if __has_include(<tcpip_adapter.h>)
    #include <tcpip_adapter.h>
    #define DIAGNOSTIC_HAS_TCPIP_ADAPTER 1
  #endif
#else
  #include <esp_netif.h>
  #define DIAGNOSTIC_HAS_ESP_NETIF 1
#endif
#if !defined(DIAGNOSTIC_HAS_SDKCONFIG)
  #define DIAGNOSTIC_HAS_SDKCONFIG 0
#endif
#include <soc/soc.h>
#include <soc/rtc.h>
#if defined(__has_include)
  #if __has_include(<soc/soc_caps.h>)
    #include <soc/soc_caps.h>
  #endif
#else
  #include <soc/soc_caps.h>
#endif
#include <Wire.h>
#include <Adafruit_NeoPixel.h>
#include <U8g2lib.h>
#include <vector>
#include <cstring>
#include <string>
#include <initializer_list>
#include "json_helpers.h"

// Configuration file - customize your setup
// Copy include/config-example.h to include/config.h and customize your settings
// config.h is excluded from version control via .gitignore
#include <config.h>

// WiFi configuration file - customize your network credentials
// For reference, see include/wifi-config-example.h
#include <wifi-config.h>

// Dual-language UI strings
#include "languages.h"

// Set default language from config.h
Language currentLanguage = DEFAULT_LANGUAGE;

static String buildActionResponseJson(bool success,
                                      const String& message,
                                      std::initializer_list<JsonFieldSpec> extraFields = {});
String htmlEscape(const String& raw);
String jsonEscape(const char* raw);
inline void sendJsonResponse(int statusCode, std::initializer_list<JsonFieldSpec> fields);
String buildTranslationsJSON();
String buildTranslationsJSON(Language lang);
inline void sendActionResponse(int statusCode,
                               bool success,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields = {});
inline void sendOperationSuccess(const String& message,
                                 std::initializer_list<JsonFieldSpec> extraFields = {});
inline void sendOperationError(int statusCode,
                               const String& message,
                               std::initializer_list<JsonFieldSpec> extraFields = {});

#if defined(__has_include)
  #if __has_include(<esp_arduino_version.h>)
    #include <esp_arduino_version.h>
  #endif
#endif

#ifndef ESP_ARDUINO_VERSION_VAL
#define ESP_ARDUINO_VERSION_VAL(major, minor, patch) ((major << 16) | (minor << 8) | (patch))
#endif

#ifndef ESP_ARDUINO_VERSION
#if defined(ESP_ARDUINO_VERSION_MAJOR) && defined(ESP_ARDUINO_VERSION_MINOR) && defined(ESP_ARDUINO_VERSION_PATCH)
#define ESP_ARDUINO_VERSION ESP_ARDUINO_VERSION_VAL(ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR, ESP_ARDUINO_VERSION_PATCH)
#else
#define ESP_ARDUINO_VERSION ESP_ARDUINO_VERSION_VAL(0, 0, 0)
#endif
#endif

// ========== CONFIGURATION (from config.h) ==========
// Version and hostname are now defined in config.h
const char* DIAGNOSTIC_VERSION_STR = DIAGNOSTIC_VERSION;
const char* MDNS_HOSTNAME_STR = DIAGNOSTIC_HOSTNAME;

// HTTPS/HTTP scheme constants
const char* const DIAGNOSTIC_SECURE_SCHEME = "https://";
const char* const DIAGNOSTIC_LEGACY_SCHEME = "http://";

#ifndef DIAGNOSTIC_UNUSED
#define DIAGNOSTIC_UNUSED __attribute__((unused))
#endif

static inline String buildAccessUrl(const String& hostOrAddress,
                                    bool preferSecure = (DIAGNOSTIC_PREFER_SECURE != 0)) {
  if (hostOrAddress.length() == 0) {
    return String();
  }
  const String secureScheme = String(DIAGNOSTIC_SECURE_SCHEME);
  const String legacyScheme = String(DIAGNOSTIC_LEGACY_SCHEME);
  return (preferSecure ? secureScheme : legacyScheme) + hostOrAddress;
}

static inline String getStableAccessHost() {
  return String(DIAGNOSTIC_HOSTNAME) + ".local";
}

