morfredus/ESP32-Diagnostic/src/main.cpp
String getArduinoCoreVersionString() {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && defined(ESP_ARDUINO_VERSION_MINOR) && defined(ESP_ARDUINO_VERSION_PATCH)
  return String(ESP_ARDUINO_VERSION_MAJOR) + "." + String(ESP_ARDUINO_VERSION_MINOR) + "." + String(ESP_ARDUINO_VERSION_PATCH);
#else
  uint32_t value = ESP_ARDUINO_VERSION;
  int major = (value >> 16) & 0xFF;
  int minor = (value >> 8) & 0xFF;
  int patch = value & 0xFF;
  return String(major) + "." + String(minor) + "." + String(patch);
#endif
}

// ========== HARDWARE PIN CONFIGURATION (from config.h) ==========
// Pins I2C pour OLED (modifiables via web ou config.h)
int I2C_SCL = DEFAULT_I2C_SCL;
int I2C_SDA = DEFAULT_I2C_SDA;

// OLED display settings (from config.h)
uint8_t oledRotation = DEFAULT_OLED_ROTATION;

// Runtime pin variables (initialized from config.h, modifiable via web interface)
int RGB_LED_PIN_R = DEFAULT_RGB_LED_PIN_R;
int RGB_LED_PIN_G = DEFAULT_RGB_LED_PIN_G;
int RGB_LED_PIN_B = DEFAULT_RGB_LED_PIN_B;
int BUZZER_PIN = DEFAULT_BUZZER_PIN;
int DHT_PIN = DEFAULT_DHT_PIN;
uint8_t DHT_SENSOR_TYPE = DEFAULT_DHT_SENSOR_TYPE;
int LIGHT_SENSOR_PIN = DEFAULT_LIGHT_SENSOR_PIN;
int DISTANCE_TRIG_PIN = DEFAULT_DISTANCE_TRIG_PIN;
int DISTANCE_ECHO_PIN = DEFAULT_DISTANCE_ECHO_PIN;
int MOTION_SENSOR_PIN = DEFAULT_MOTION_SENSOR_PIN;

// ========== OBJETS GLOBAUX ==========
WebServer server(WEB_SERVER_PORT);
WiFiMulti wifiMulti;
#if DIAGNOSTIC_HAS_MDNS
bool mdnsServiceActive = false;
bool wifiPreviouslyConnected = false;
unsigned long lastMDNSAttempt = 0;
bool mdnsLastAttemptFailed = false;
#if defined(DIAGNOSTIC_USES_IDF_MDNS)
bool mdnsResponderInitialized = false;
#endif
#endif
U8G2_SSD1306_128X64_NONAME_F_HW_I2C oled(U8G2_R0, U8X8_PIN_NONE);

// NeoPixel (from config.h)
int LED_PIN = DEFAULT_NEOPIXEL_PIN;
int LED_COUNT = DEFAULT_NEOPIXEL_COUNT;
Adafruit_NeoPixel *strip = nullptr;

bool neopixelTested = false;
bool neopixelAvailable = false;
bool neopixelSupported = false;
String neopixelTestResult = String(Texts::not_tested);

// Built-in LED (from config.h)
int BUILTIN_LED_PIN = DEFAULT_BUILTIN_LED_PIN;
bool builtinLedTested = false;
bool builtinLedAvailable = false;
String builtinLedTestResult = String(Texts::not_tested);

bool oledTested = false;
bool oledAvailable = false;
String oledTestResult = String(Texts::not_tested);

// Exécution asynchrone des tests matériels
typedef void (*TestRoutine)();

struct AsyncTestRunner {
  const char* taskName;
  TaskHandle_t taskHandle;
  volatile bool running;
};

struct AsyncTestTaskArgs {
  AsyncTestRunner* runner;
  TestRoutine routine;
};

static void asyncTestTask(void* parameters) {
  AsyncTestTaskArgs* args = static_cast<AsyncTestTaskArgs*>(parameters);
  if (args && args->routine) {
    args->routine();
  }
  if (args) {
    if (args->runner) {
      args->runner->running = false;
      args->runner->taskHandle = nullptr;
    }
    delete args;
  }
  vTaskDelete(nullptr);
}

static bool startAsyncTest(AsyncTestRunner& runner,
                           TestRoutine routine,
                           bool& alreadyRunning,
                           uint32_t stackSize = 4096,
                           UBaseType_t priority = 1) {
  alreadyRunning = runner.running;
  if (runner.running) {
    return false;
  }

  AsyncTestTaskArgs* args = new AsyncTestTaskArgs{&runner, routine};
  runner.running = true;

#if CONFIG_FREERTOS_UNICORE
  const BaseType_t targetCore = tskNO_AFFINITY;
#else
  const BaseType_t targetCore = 1;
#endif

  BaseType_t result = xTaskCreatePinnedToCore(asyncTestTask,
                                              runner.taskName,
                                              stackSize,
                                              args,
                                              priority,
                                              &runner.taskHandle,
                                              targetCore);
  if (result != pdPASS) {
    runner.running = false;
    runner.taskHandle = nullptr;
    delete args;
    alreadyRunning = false;
    return false;
  }

  alreadyRunning = false;
  return true;
}

// Orchestrateurs asynchrones des tests lents
static AsyncTestRunner builtinLedTestRunner = {"BuiltinLEDTest", nullptr, false};
static AsyncTestRunner neopixelTestRunner = {"NeoPixelTest", nullptr, false};
static AsyncTestRunner oledTestRunner = {"OLEDTest", nullptr, false};
static AsyncTestRunner rgbLedTestRunner = {"RgbLedTest", nullptr, false};
static AsyncTestRunner buzzerTestRunner = {"BuzzerTest", nullptr, false};

bool runtimeBLE = false;

String adcTestResult = String(Texts::not_tested);
String pwmTestResult = String(Texts::not_tested);
String partitionsInfo;
String spiInfo;
String stressTestResult = String(Texts::not_tested);
// Memory stress telemetry cache
size_t stressAllocationCount = 0;
unsigned long stressDurationMs = 0;

// Résultats de tests des nouveaux capteurs
String rgbLedTestResult = String(Texts::not_tested);
bool rgbLedAvailable = false;

String buzzerTestResult = String(Texts::not_tested);
bool buzzerAvailable = false;

String dhtTestResult = String(Texts::not_tested);
bool dhtAvailable = false;
float dhtTemperature = -999.0;
float dhtHumidity = -999.0;

String lightSensorTestResult = String(Texts::not_tested);
bool lightSensorAvailable = false;
int lightSensorValue = -1;

String distanceSensorTestResult = String(Texts::not_tested);
bool distanceSensorAvailable = false;
float distanceValue = -1.0;

String motionSensorTestResult = String(Texts::not_tested);
bool motionSensorAvailable = false;
bool motionDetected = false;

// ========== STRUCTURES ==========
struct DiagnosticInfo {
  String chipModel;
  String chipRevision;
  int cpuCores;
  uint32_t cpuFreqMHz;
  uint32_t flashSize;
  uint32_t psramSize;
  String macAddress;
  
  uint32_t heapSize;
  uint32_t freeHeap;
  uint32_t minFreeHeap;
  uint32_t maxAllocHeap;
  
  bool hasWiFi;
  bool hasBT;
  bool hasBLE;
  String wifiSSID;
  int wifiRSSI;
  String ipAddress;
  bool mdnsAvailable;
  bool bluetoothEnabled;
  bool bluetoothAdvertising;
  String bluetoothName;
  String bluetoothAddress;

  String gpioList;
  int totalGPIO;
  
