morfredus/ESP32-Diagnostic/src/main.cpp
  digitalWrite(RGB_LED_PIN_R, LOW);
  digitalWrite(RGB_LED_PIN_G, LOW);
  digitalWrite(RGB_LED_PIN_B, LOW);
  delay(120);

  digitalWrite(RGB_LED_PIN_R, HIGH);
  delay(150);
  digitalWrite(RGB_LED_PIN_R, LOW);

  digitalWrite(RGB_LED_PIN_G, HIGH);
  delay(150);
  digitalWrite(RGB_LED_PIN_G, LOW);

  digitalWrite(RGB_LED_PIN_B, HIGH);
  delay(150);
  digitalWrite(RGB_LED_PIN_B, LOW);

  rgbLedTestResult = String(Texts::ok);
  rgbLedAvailable = true;
  Serial.println("LED RGB: OK");
}

void setRGBLedColor(int r, int g, int b) {
  if (RGB_LED_PIN_R >= 0 && RGB_LED_PIN_G >= 0 && RGB_LED_PIN_B >= 0) {
    analogWrite(RGB_LED_PIN_R, r);
    analogWrite(RGB_LED_PIN_G, g);
    analogWrite(RGB_LED_PIN_B, b);
  }
}

// TEST BUZZER
void testBuzzer() {
  Serial.println("\r\n=== TEST BUZZER ===");

  if (BUZZER_PIN < 0) {
    buzzerTestResult = String(Texts::configuration_invalid);
    buzzerAvailable = false;
    Serial.println("Buzzer: Configuration invalide");
    return;
  }

  pinMode(BUZZER_PIN, OUTPUT);
  Serial.printf("Test Buzzer - Pin:%d\r\n", BUZZER_PIN);

  tone(BUZZER_PIN, 1000, 160);
  delay(220);
  tone(BUZZER_PIN, 1500, 160);
  delay(220);
  tone(BUZZER_PIN, 2000, 160);
  delay(220);
  noTone(BUZZER_PIN);

  buzzerTestResult = String(Texts::ok);
  buzzerAvailable = true;
  Serial.println("Buzzer: OK");
}

void playBuzzerTone(int frequency, int duration) {
  if (BUZZER_PIN >= 0) {
    tone(BUZZER_PIN, frequency, duration);
  }
}

// DHT sensor helpers
static inline const char* getDhtSensorName() {
  return (DHT_SENSOR_TYPE == 22) ? "DHT22" : "DHT11";
}

// TEST DHT SENSOR
void testDHTSensor() {
  const char* sensorName = getDhtSensorName();
  Serial.printf("\r\n=== TEST %s ===\r\n", sensorName);

  if (DHT_PIN < 0) {
    dhtTestResult = String(Texts::configuration_invalid);
    dhtAvailable = false;
    Serial.printf("%s: Configuration invalide\r\n", sensorName);
    return;
  }

  Serial.printf("Lecture %s - Pin:%d\r\n", sensorName, DHT_PIN);

  pinMode(DHT_PIN, OUTPUT);
  digitalWrite(DHT_PIN, LOW);
  delay(20);
  digitalWrite(DHT_PIN, HIGH);
  delayMicroseconds(40);
  pinMode(DHT_PIN, INPUT_PULLUP);

  uint8_t data[5] = {0};
  uint8_t bits[40] = {0};

  unsigned long timeout = millis();
  while (digitalRead(DHT_PIN) == HIGH) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  timeout = millis();
  while (digitalRead(DHT_PIN) == LOW) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  timeout = millis();
  while (digitalRead(DHT_PIN) == HIGH) {
    if (millis() - timeout > 100) {
      dhtTestResult = String(Texts::error_label);
      dhtAvailable = false;
      Serial.printf("%s: Timeout\r\n", sensorName);
      return;
    }
  }

  for (int i = 0; i < 40; i++) {
    timeout = micros();
    while (digitalRead(DHT_PIN) == LOW) {
      if (micros() - timeout > 100) break;
    }

    unsigned long t = micros();
    timeout = micros();
    while (digitalRead(DHT_PIN) == HIGH) {
      if (micros() - timeout > 100) break;
    }

    if ((micros() - t) > 40) {
      bits[i] = 1;
    }
  }

  for (int i = 0; i < 5; i++) {
    data[i] = 0;
    for (int j = 0; j < 8; j++) {
      data[i] <<= 1;
      data[i] |= bits[i * 8 + j];
    }
  }

  if (data[4] == ((data[0] + data[1] + data[2] + data[3]) & 0xFF)) {
    if (DHT_SENSOR_TYPE == 22) {
      uint16_t rawHumidity = (static_cast<uint16_t>(data[0]) << 8) | data[1];
      uint16_t rawTemperature = (static_cast<uint16_t>(data[2]) << 8) | data[3];
      bool negative = rawTemperature & 0x8000;
      if (negative) {
        rawTemperature &= 0x7FFF;
      }
      dhtHumidity = rawHumidity * 0.1f;
      dhtTemperature = rawTemperature * 0.1f;
      if (negative) {
        dhtTemperature = -dhtTemperature;
      }
    } else {
      dhtHumidity = static_cast<float>(data[0]) + static_cast<float>(data[1]) * 0.1f;
      dhtTemperature = static_cast<float>(data[2]) + static_cast<float>(data[3]) * 0.1f;
    }
    dhtTestResult = String(Texts::ok);
    dhtAvailable = true;
    Serial.printf("%s: T=%.1f°C H=%.1f%%\r\n", sensorName, dhtTemperature, dhtHumidity);
  } else {
    dhtTestResult = String(Texts::error_label);
    dhtAvailable = false;
    Serial.printf("%s: Checksum error\r\n", sensorName);
  }
}

// TEST LIGHT SENSOR
void testLightSensor() {
  Serial.println("\r\n=== TEST LIGHT SENSOR ===");

  if (LIGHT_SENSOR_PIN < 0) {
    lightSensorTestResult = String(Texts::configuration_invalid);
    lightSensorAvailable = false;
    Serial.println("Light Sensor: Configuration invalide");
    return;
  }

  pinMode(LIGHT_SENSOR_PIN, INPUT);
  Serial.printf("Lecture Light Sensor - Pin:%d\r\n", LIGHT_SENSOR_PIN);

  int sum = 0;
  const int samples = 6;
  for (int i = 0; i < samples; i++) {
    sum += analogRead(LIGHT_SENSOR_PIN);
    delay(8);
    yield();
  }
  lightSensorValue = sum / samples;

  lightSensorTestResult = String(Texts::ok);
  lightSensorAvailable = true;
  Serial.printf("Light Sensor: %d\r\n", lightSensorValue);
}

// TEST DISTANCE SENSOR
void testDistanceSensor() {
  Serial.println("\r\n=== TEST DISTANCE SENSOR (HC-SR04) ===");

  if (DISTANCE_TRIG_PIN < 0 || DISTANCE_ECHO_PIN < 0) {
    distanceSensorTestResult = String(Texts::configuration_invalid);
    distanceSensorAvailable = false;
    Serial.println("Distance Sensor: Configuration invalide");
    return;
  }

  pinMode(DISTANCE_TRIG_PIN, OUTPUT);
  pinMode(DISTANCE_ECHO_PIN, INPUT);

  Serial.printf("Distance Sensor - Trig:%d Echo:%d\r\n", DISTANCE_TRIG_PIN, DISTANCE_ECHO_PIN);

  digitalWrite(DISTANCE_TRIG_PIN, LOW);
  delayMicroseconds(2);
  digitalWrite(DISTANCE_TRIG_PIN, HIGH);
  delayMicroseconds(10);
  digitalWrite(DISTANCE_TRIG_PIN, LOW);

  long duration = pulseIn(DISTANCE_ECHO_PIN, HIGH, 30000);

  if (duration > 0) {
    distanceValue = duration * 0.034 / 2;
    distanceSensorTestResult = String(Texts::ok);
    distanceSensorAvailable = true;
    Serial.printf("Distance: %.2f cm\r\n", distanceValue);
  } else {
    distanceSensorTestResult = String(Texts::error_label);
    distanceSensorAvailable = false;
    Serial.println("Distance Sensor: No echo");
  }
}

// TEST MOTION SENSOR
void testMotionSensor() {
  Serial.println("\r\n=== TEST MOTION SENSOR (PIR) ===");

  if (MOTION_SENSOR_PIN < 0) {
    motionSensorTestResult = String(Texts::configuration_invalid);
    motionSensorAvailable = false;
    Serial.println("Motion Sensor: Configuration invalide");
    return;
  }

  pinMode(MOTION_SENSOR_PIN, INPUT);
  Serial.printf("Motion Sensor - Pin:%d\r\n", MOTION_SENSOR_PIN);

  delay(30);
  yield();
  motionDetected = digitalRead(MOTION_SENSOR_PIN);

  motionSensorTestResult = String(Texts::ok);
  motionSensorAvailable = true;
  Serial.printf("Motion: %s\r\n", motionDetected ? "Detected" : "None");
}

// ========== TEST STRESS MÉMOIRE ==========
void memoryStressTest() {
  Serial.println("\r\n=== STRESS TEST MEMOIRE ===");
  
  unsigned long startMs = millis();
  stressAllocationCount = 0;
  stressDurationMs = 0;

  const int allocSize = 1024;
  int maxAllocs = 0;
  std::vector<void*> allocations;
  
  Serial.println("Allocation progressive...");
  while(true) {
    void* ptr = malloc(allocSize);
    if (!ptr) break;
    allocations.push_back(ptr);
    maxAllocs++;
    
    if (maxAllocs % 100 == 0) {
      Serial.printf("Alloue: %d KB\r\n", maxAllocs);
    }
  }
  
  Serial.printf("Max allocations: %d blocs (%d KB)\r\n", maxAllocs, maxAllocs);


