morfredus/ESP32-Diagnostic/src/main.cpp
  sendOperationSuccess(message);
}

void handleNeoPixelConfig() {
  if (server.hasArg("gpio") && server.hasArg("count")) {
    int newGPIO = server.arg("gpio").toInt();
    int newCount = server.arg("count").toInt();
    
    if (newGPIO >= 0 && newGPIO <= 48 && newCount > 0 && newCount <= 100) {
      LED_PIN = newGPIO;
      LED_COUNT = newCount;
      if (strip) delete strip;
      strip = new Adafruit_NeoPixel(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);
      resetNeoPixelTest();
      String message = String(Texts::config) + " " + String(Texts::gpio) + " " + String(LED_PIN);
      sendOperationSuccess(message);
      return;
    }
  }
  sendOperationError(400, Texts::configuration_invalid.str());
}

void handleNeoPixelTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(neopixelTestRunner, runNeopixelTestTask, alreadyRunning);

  if (started) {
    sendActionResponse(202, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", neopixelAvailable),
      jsonStringField("result", neopixelTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendActionResponse(200, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", neopixelAvailable),
      jsonStringField("result", neopixelTestResult)
    });
    return;
  }

  resetNeoPixelTest();
  testNeoPixel();
  sendActionResponse(200, neopixelAvailable, neopixelTestResult, {
    jsonBoolField("running", false),
    jsonBoolField("available", neopixelAvailable),
    jsonStringField("result", neopixelTestResult)
  });
}

void handleNeoPixelPattern() {
  if (!server.hasArg("pattern")) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  String pattern = server.arg("pattern");
  if (!strip) {
    String message = String(Texts::neopixel) + " - " + String(Texts::not_detected);
    sendOperationError(400, message);
    return;
  }

  String message;
  if (pattern == "rainbow") {
    neopixelRainbow();
    message = String(Texts::rainbow) + " " + String(Texts::ok);
  } else if (pattern == "blink") {
    neopixelBlink(strip->Color(255, 0, 0), 5);
    message = String(Texts::blink) + " " + String(Texts::ok);
  } else if (pattern == "fade") {
    neopixelFade(strip->Color(0, 0, 255));
    message = String(Texts::fade) + " " + String(Texts::ok);
  } else if (pattern == "chase") {
    neopixelChase();
    message = String(Texts::chase) + " " + String(Texts::ok);
  } else if (pattern == "off") {
    strip->clear();
    strip->show();
    neopixelTested = false;
    message = String(Texts::off);
  } else {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  sendOperationSuccess(message);
}

void handleNeoPixelColor() {
  if (!server.hasArg("r") || !server.hasArg("g") || !server.hasArg("b") || !strip) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  int r = server.arg("r").toInt();
  int g = server.arg("g").toInt();
  int b = server.arg("b").toInt();

  strip->fill(strip->Color(r, g, b));
  strip->show();
  neopixelTested = false;

  String message = "RGB(" + String(r) + "," + String(g) + "," + String(b) + ")";
  sendOperationSuccess(message);
}

void handleOLEDConfig() {
  if (server.hasArg("sda") && server.hasArg("scl") && server.hasArg("rotation")) {
    int newSDA = server.arg("sda").toInt();
    int newSCL = server.arg("scl").toInt();
    int newRotation = server.arg("rotation").toInt();

    if (newSDA >= 0 && newSDA <= 48 && newSCL >= 0 && newSCL <= 48 && newRotation >= 0 && newRotation <= 3) {
      bool pinsChanged = (I2C_SDA != newSDA) || (I2C_SCL != newSCL);
      bool rotationChanged = (oledRotation != static_cast<uint8_t>(newRotation));

      I2C_SDA = newSDA;
      I2C_SCL = newSCL;
      oledRotation = static_cast<uint8_t>(newRotation);

      if (pinsChanged || rotationChanged) {
        resetOLEDTest();
        Wire.end();
        detectOLED();
      } else if (oledAvailable) {
        applyOLEDOrientation();
      }

      String message = "I2C reconfigure: SDA:" + String(I2C_SDA) + " SCL:" + String(I2C_SCL) + " Rot:" + String(oledRotation);
      sendOperationSuccess(message, {
        jsonNumberField("sda", I2C_SDA),
        jsonNumberField("scl", I2C_SCL),
        jsonNumberField("rotation", oledRotation)
      });
      return;
    }
  }
  sendOperationError(400, Texts::configuration_invalid.str());
}

void handleOLEDTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(oledTestRunner, runOledTestTask, alreadyRunning, 6144, 1);

  if (started) {
    sendActionResponse(202, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", oledAvailable),
      jsonStringField("result", oledTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendActionResponse(200, true, String(Texts::test_in_progress), {
      jsonBoolField("running", true),
      jsonBoolField("available", oledAvailable),
      jsonStringField("result", oledTestResult)
    });
    return;
  }

  resetOLEDTest();
  testOLED();
  sendActionResponse(200, oledAvailable, oledTestResult, {
    jsonBoolField("running", false),
    jsonBoolField("available", oledAvailable),
    jsonStringField("result", oledTestResult)
  });
}

void handleOLEDStep() {
  if (!server.hasArg("step")) {
    sendOperationError(400, Texts::oled_step_unknown.str());
    return;
  }

  String stepId = server.arg("step");

  if (!oledAvailable) {
    sendActionResponse(200, false, Texts::oled_step_unavailable.str());
    return;
  }

  bool ok = performOLEDStep(stepId);
  if (!ok) {
    sendOperationError(400, Texts::oled_step_unknown.str());
    return;
  }

  String label = getOLEDStepLabel(stepId);
  String message = String(Texts::oled_step_executed_prefix) + " " + label;
  sendOperationSuccess(message);
}

void handleOLEDMessage() {
  if (!server.hasArg("message")) {
    sendOperationError(400, Texts::configuration_invalid.str());
    return;
  }

  String message = server.arg("message");
  oledShowMessage(message);
  // Use translation key instead of hardcoded string
  sendOperationSuccess(Texts::message_displayed.str());
}

void handleADCTest() {
  testADC();
  String json;
  json.reserve(adcReadings.size() * 60 + 50);  // Estimate size to avoid reallocations
  json = "{\"readings\":[";
  for (size_t i = 0; i < adcReadings.size(); i++) {
    if (i > 0) json += ",";
    json += "{\"pin\":" + String(adcReadings[i].pin) + ",\"raw\":" + String(adcReadings[i].rawValue) +
            ",\"voltage\":" + String(adcReadings[i].voltage, 2) + "}";
  }
  json += "],\"result\":\"" + adcTestResult + "\"}";
  server.send(200, "application/json", json);
}

void handlePWMTest() {
  testPWM();
  sendJsonResponse(200, { jsonStringField("result", pwmTestResult) });
}

void handleSPIScan() {
  scanSPI();
  sendJsonResponse(200, { jsonStringField("info", spiInfo) });
}

void handlePartitionsList() {
  listPartitions();
  sendJsonResponse(200, { jsonStringField("partitions", partitionsInfo) });
}

void handleStressTest() {
  memoryStressTest();
  sendJsonResponse(200, {
    jsonStringField("result", stressTestResult),
    jsonNumberField("allocations", static_cast<unsigned long>(stressAllocationCount)),
    jsonNumberField("durationMs", stressDurationMs),
    jsonStringField("allocationsLabel", stressTestResult)
  });
}

