morfredus/ESP32-Diagnostic/src/main.cpp
// Handlers API pour les nouveaux capteurs
void handleRGBLedConfig() {
  if (server.hasArg("r") && server.hasArg("g") && server.hasArg("b")) {
    RGB_LED_PIN_R = server.arg("r").toInt();
    RGB_LED_PIN_G = server.arg("g").toInt();
    RGB_LED_PIN_B = server.arg("b").toInt();
    sendActionResponse(200, true, String(Texts::ok));
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleRGBLedTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(rgbLedTestRunner, runRgbLedTestTask, alreadyRunning, 3072, 1);

  if (started) {
    sendJsonResponse(202, {
      jsonBoolField("running", true),
      jsonBoolField("success", rgbLedAvailable),
      jsonStringField("result", rgbLedTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendJsonResponse(200, {
      jsonBoolField("running", true),
      jsonBoolField("success", rgbLedAvailable),
      jsonStringField("result", rgbLedTestResult)
    });
    return;
  }

  testRGBLed();
  sendJsonResponse(200, {
    jsonBoolField("running", false),
    jsonBoolField("success", rgbLedAvailable),
    jsonStringField("result", rgbLedTestResult)
  });
}

void handleRGBLedColor() {
  if (server.hasArg("r") && server.hasArg("g") && server.hasArg("b")) {
    int r = server.arg("r").toInt();
    int g = server.arg("g").toInt();
    int b = server.arg("b").toInt();
    setRGBLedColor(r, g, b);
    sendActionResponse(200, true, "RGB(" + String(r) + "," + String(g) + "," + String(b) + ")");
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleBuzzerConfig() {
  if (server.hasArg("pin")) {
    BUZZER_PIN = server.arg("pin").toInt();
    sendActionResponse(200, true, String(Texts::ok));
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleBuzzerTest() {
  bool alreadyRunning = false;
  bool started = startAsyncTest(buzzerTestRunner, runBuzzerTestTask, alreadyRunning, 3072, 1);

  if (started) {
    sendJsonResponse(202, {
      jsonBoolField("running", true),
      jsonBoolField("success", buzzerAvailable),
      jsonStringField("result", buzzerTestResult)
    });
    return;
  }

  if (alreadyRunning) {
    sendJsonResponse(200, {
      jsonBoolField("running", true),
      jsonBoolField("success", buzzerAvailable),
      jsonStringField("result", buzzerTestResult)
    });
    return;
  }

  testBuzzer();
  sendJsonResponse(200, {
    jsonBoolField("running", false),
    jsonBoolField("success", buzzerAvailable),
    jsonStringField("result", buzzerTestResult)
  });
}

void handleBuzzerTone() {
  if (server.hasArg("freq") && server.hasArg("duration")) {
    int freq = server.arg("freq").toInt();
    int duration = server.arg("duration").toInt();
    playBuzzerTone(freq, duration);
    sendActionResponse(200, true, String(freq) + "Hz");
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleDHTConfig() {
  bool updated = false;

  if (server.hasArg("pin")) {
    DHT_PIN = server.arg("pin").toInt();
    updated = true;
  }

  if (server.hasArg("type")) {
    String rawType = server.arg("type");
    rawType.trim();
    rawType.toUpperCase();

    uint8_t candidate = 0;
    if (rawType == "DHT22" || rawType == "22") {
      candidate = 22;
    } else if (rawType == "DHT11" || rawType == "11") {
      candidate = 11;
    }

    if (candidate == 11 || candidate == 22) {
      DHT_SENSOR_TYPE = candidate;
      updated = true;
    } else {
      sendActionResponse(400, false, String(Texts::configuration_invalid));
      return;
    }
  }

  if (updated) {
    sendActionResponse(200,
                       true,
                       String(Texts::ok),
                       {jsonNumberField("type", static_cast<int>(DHT_SENSOR_TYPE))});
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleDHTTest() {
  testDHTSensor();
  sendJsonResponse(200, {
    jsonBoolField("success", dhtAvailable),
    jsonStringField("result", dhtTestResult),
    jsonFloatField("temperature", dhtTemperature, 1),
    jsonFloatField("humidity", dhtHumidity, 1),
    jsonNumberField("type", static_cast<int>(DHT_SENSOR_TYPE))
  });
}

void handleLightSensorConfig() {
  if (server.hasArg("pin")) {
    LIGHT_SENSOR_PIN = server.arg("pin").toInt();
    sendActionResponse(200, true, String(Texts::ok));
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleLightSensorTest() {
  testLightSensor();
  sendJsonResponse(200, {
    jsonBoolField("success", lightSensorAvailable),
    jsonStringField("result", lightSensorTestResult),
    jsonNumberField("value", lightSensorValue)
  });
}

void handleDistanceSensorConfig() {
  if (server.hasArg("trig") && server.hasArg("echo")) {
    DISTANCE_TRIG_PIN = server.arg("trig").toInt();
    DISTANCE_ECHO_PIN = server.arg("echo").toInt();
    sendActionResponse(200, true, String(Texts::ok));
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleDistanceSensorTest() {
  testDistanceSensor();
  sendJsonResponse(200, {
    jsonBoolField("success", distanceSensorAvailable),
    jsonStringField("result", distanceSensorTestResult),
    jsonFloatField("distance", distanceValue, 2)
  });
}

void handleMotionSensorConfig() {
  if (server.hasArg("pin")) {
    MOTION_SENSOR_PIN = server.arg("pin").toInt();
    sendActionResponse(200, true, String(Texts::ok));
  } else {
    sendActionResponse(400, false, String(Texts::configuration_invalid));
  }
}

void handleMotionSensorTest() {
  testMotionSensor();
  sendJsonResponse(200, {
    jsonBoolField("success", motionSensorAvailable),
    jsonStringField("result", motionSensorTestResult),
    jsonBoolField("motion", motionDetected)
  });
}

void handleBenchmark() {
  unsigned long cpuTime = benchmarkCPU();
  unsigned long memTime = benchmarkMemory();

  diagnosticData.cpuBenchmark = cpuTime;
  diagnosticData.memBenchmark = memTime;

