morfredus/ESP32-Diagnostic/src/main.cpp
// Language-aware translation extraction endpoint
void handleGetTranslations() {
  Language target = currentLanguage;
  if (server.hasArg("lang")) {
    String requested = server.arg("lang");
    requested.toLowerCase();
    if (requested == "fr") {
      target = LANG_FR;
    } else if (requested == "en") {
      target = LANG_EN;
    } else {
      sendJsonResponse(400, {
        jsonBoolField("success", false),
        jsonStringField("error", String(Texts::language_switch_error))
      });
      return;
    }
  }

  server.send(200, "application/json; charset=utf-8", buildTranslationsJSON(target));
}


// ========== INTERFACE WEB PRINCIPALE MULTILINGUE ==========
// Unique JavaScript handler defined in sketch (handleJavaScriptRoute)
void handleJavaScriptRoute() {
  server.send(200, "application/javascript; charset=utf-8", generateJavaScript());
}

// Modern web interface with dynamic tabs
void handleRoot() {
  server.send(200, "text/html; charset=utf-8", generateHTML());
}

void handleJavaScript() {
  server.send(200, "application/javascript; charset=utf-8", generateJavaScript());
}

// ========== SETUP COMPLET ==========
void setup() {
  Serial.begin(115200);
  delay(1000);

  Serial.println("\r\n===============================================");
  Serial.println("     DIAGNOSTIC ESP32 MULTILINGUE");
  Serial.printf("     Version %s - FR/EN\r\n", DIAGNOSTIC_VERSION_STR);
  Serial.printf("     Arduino Core %s\r\n", getArduinoCoreVersionString().c_str());
  Serial.println("===============================================\r\n");

  printPSRAMDiagnostic();

  // --- [NEW FEATURE] Early OLED detection for WiFi status feedback ---
  detectOLED();

  // WiFi
  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);

  WiFi.setSleep(false);
  configureNetworkHostname();
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 0)
  WiFi.setScanMethod(WIFI_ALL_CHANNEL_SCAN);
#ifdef WIFI_CONNECT_AP_BY_SIGNAL
  WiFi.setSortMethod(WIFI_CONNECT_AP_BY_SIGNAL);
#endif
#endif
  wifiMulti.addAP(WIFI_SSID_1, WIFI_PASS_1);
  wifiMulti.addAP(WIFI_SSID_2, WIFI_PASS_2);

  Serial.println("Connexion WiFi...");
  const int maxWiFiAttempts = 40;
  int attempt = 0;
  if (oledAvailable) {
    oledShowWiFiStatus(String(Texts::wifi_connection),
                       String(Texts::loading),
                       "",
                       0);
  }
  while (wifiMulti.run() != WL_CONNECTED && attempt < maxWiFiAttempts) {
    delay(500);
    Serial.print(".");
    attempt++;
    if (oledAvailable) {
      int progress = (attempt * 100) / maxWiFiAttempts;
      if (progress > 100) {
        progress = 100;
      }
      String detail = String(Texts::loading) + " " + String(progress) + "%";
      oledShowWiFiStatus(String(Texts::wifi_connection),
                         detail,
                         "",
                         progress);
    }
  }

  bool wifiConnected = (WiFi.status() == WL_CONNECTED);
#if DIAGNOSTIC_HAS_MDNS
  wifiPreviouslyConnected = wifiConnected;
#endif

  if (wifiConnected) {
    Serial.println("\r\n\r\nWiFi OK!");
    Serial.printf("SSID: %s\r\n", WiFi.SSID().c_str());
    Serial.printf("IP: %s\r\n\r\n", WiFi.localIP().toString().c_str());
    if (oledAvailable) {
      String detail = String(Texts::connected) + ": " + WiFi.SSID();
      String footer = WiFi.localIP().toString();
      oledShowWiFiStatus(String(Texts::wifi_connection), detail, footer, 100);
    }
    if (startMDNSService(true)) {
      Serial.printf("[Accès] Lien constant : %s\r\n", getStableAccessURL().c_str());
    } else {
      Serial.println("[mDNS] Initialisation différée - nouvel essai automatique");
    }
  } else {
    Serial.println("\r\n\r\nPas de WiFi\r\n");
    Serial.printf("[Accès] Lien constant disponible après connexion : %s\r\n", getStableAccessURL().c_str());
    if (oledAvailable) {
      oledShowWiFiStatus(String(Texts::wifi_connection),
                         String(Texts::disconnected),
                         getStableAccessURL(),
                         -1);
    }
  }

  // Détections
  detectBuiltinLED();
  detectNeoPixelSupport();

  if (strip != nullptr) {
    strip->begin();
    strip->clear();
    strip->show();
  }
  
  if (ENABLE_I2C_SCAN) {
    scanI2C();
  }
  
  scanSPI();
  listPartitions();
  
  collectDiagnosticInfo();
  collectDetailedMemory();

  // ========== ROUTES SERVEUR ==========
  server.on("/", handleRoot);
  server.on("/js/app.js", handleJavaScriptRoute);

  // **TRANSLATION API**
  server.on("/api/get-translations", handleGetTranslations);
  server.on("/api/set-language", handleSetLanguage);

  // Data endpoints
  server.on("/api/status", handleStatus);
  server.on("/api/overview", handleOverview);
  server.on("/api/system-info", handleSystemInfo);
  server.on("/api/memory", handleMemory);
  server.on("/api/wifi-info", handleWiFiInfo);
  server.on("/api/peripherals", handlePeripherals);
  server.on("/api/leds-info", handleLedsInfo);
  server.on("/api/screens-info", handleScreensInfo);

  // GPIO & WiFi
  server.on("/api/test-gpio", handleTestGPIO);
  server.on("/api/wifi-scan", handleWiFiScan);
  server.on("/api/i2c-scan", handleI2CScan);

  // LED intégrée
  server.on("/api/builtin-led-config", handleBuiltinLEDConfig);
  server.on("/api/builtin-led-test", handleBuiltinLEDTest);
  server.on("/api/builtin-led-control", handleBuiltinLEDControl);
  
  // NeoPixel
  server.on("/api/neopixel-config", handleNeoPixelConfig);
  server.on("/api/neopixel-test", handleNeoPixelTest);
  server.on("/api/neopixel-pattern", handleNeoPixelPattern);
  server.on("/api/neopixel-color", handleNeoPixelColor);
  
  // Écrans
  server.on("/api/oled-test", handleOLEDTest);
  server.on("/api/oled-step", handleOLEDStep);
  server.on("/api/oled-message", handleOLEDMessage);
  server.on("/api/oled-config", handleOLEDConfig);
  
  // Tests avancés
  server.on("/api/adc-test", handleADCTest);
  server.on("/api/pwm-test", handlePWMTest);
  server.on("/api/spi-scan", handleSPIScan);
  server.on("/api/partitions-list", handlePartitionsList);
  server.on("/api/stress-test", handleStressTest);

